tap "ariga/tap"
tap "arl/arl"
tap "codecrafters-io/tap"
tap "coursier/formulas"
tap "hashicorp/tap"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "mongodb/brew"
tap "nikitabobko/tap"
tap "oven-sh/bun"
tap "samtay/tui"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# High performance key/value database
brew "berkeley-db"
# Highly capable, feature-rich programming language
brew "perl"
# Aquarium animation in ASCII art
brew "asciiquarium"
# Vector graphics library with cross-device output support
brew "cairo"
# Sexy ANSI fonts for the console
brew "cfonts"
# Cloudflare Tunnel client (formerly Argo Tunnel)
brew "cloudflared"
# Console Matrix
brew "cmatrix"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Apjanke's fork of the classic cowsay project
brew "cowsay"
# Modern diagram scripting language that turns text to diagrams
brew "d2"
# Generic library support script
brew "libtool"
# Simple, fast and user-friendly alternative to find
brew "fd"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Fast web fuzzer written in Go
brew "ffuf"
# Command-line tools for fly.io services
brew "flyctl"
# Monitor a directory for changes and run a shell command
brew "fswatch"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# Library for encoding and decoding .avif files
brew "libavif"
# Graphics library to dynamically manipulate images
brew "gd"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Extensions to follow Vincent Driessen's branching model
brew "git-flow"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Directory/file & DNS busting tool written in Go
brew "gobuster"
# Stricter gofmt
brew "gofumpt"
# Database migrations CLI tool
brew "golang-migrate"
# Fast linters runner for Go
brew "golangci-lint"
# WSDL2Go code generation as well as its SOAP proxy
brew "gowsdl"
# Development kit for the Java programming language
brew "openjdk"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Image processing tools collection
brew "graphicsmagick"
# Image manipulation
brew "netpbm"
# GNU triangulated surface library
brew "gts"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Improved top (interactive process viewer)
brew "htop"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Friendly PIL fork (Python Imaging Library)
brew "pillow"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Modern load testing tool, using Go and JavaScript
brew "k6"
# Open-source distributed event streaming platform
brew "kafka"
# Simple terminal UI for git commands
brew "lazygit"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# Postgres C API library
brew "libpq"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Package manager for the Lua programming language
brew "luarocks"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Fast, flexible, config-based cli for linting Markdown/CommonMark files
brew "markdownlint-cli2"
# Run a Kubernetes cluster locally
brew "minikube"
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"
# Atlas CLI enables you to manage your MongoDB Atlas
brew "mongodb-atlas-cli", link: false
# Open source relational database management system
brew "mysql"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node@16"
# Manage multiple Node.js versions
brew "nvm"
# Adds an OCR text layer to scanned PDF files
brew "ocrmypdf"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# CLI for Postgres with auto-completion and syntax highlighting
brew "pgcli"
# Fast, disk space efficient package manager
brew "pnpm"
# Tool for managing OCI containers and pods
brew "podman"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Python version management
brew "pyenv"
# Generic machine emulator and virtualizer
brew "qemu"
# Messaging and streaming broker
brew "rabbitmq"
# Persistent key-value database, with built-in net interface
brew "redis"
# SVG rendering tool and library
brew "resvg"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Generate type safe Go from SQL
brew "sqlc"
# Penetration testing for SQL injection and database servers
brew "sqlmap"
# User interface to the TELNET protocol
brew "telnet"
# Enables extra languages support for Tesseract
brew "tesseract-lang"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Command-line interface for Vercel
brew "vercel-cli"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Extensible command-line tool to format YAML files
brew "yamlfmt"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# A database toolkit
brew "ariga/tap/atlas"
# Git in your tmux status bar.
brew "arl/arl/gitmux"
# CodeCrafters CLI
brew "codecrafters-io/tap/codecrafters"
# Launcher for Coursier
brew "coursier/formulas/coursier"
# Terraform
brew "hashicorp/tap/terraform"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# Tetris in your terminal
brew "samtay/tui/tetris"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# Write, edit, and chat about your code with AI
cask "cursor"
cask "font-symbols-only-nerd-font"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Game development engine
cask "godot"
# Open Source Multimedia Framework
cask "gstreamer-runtime"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Minecraft launcher
cask "prismlauncher"
# Control your tools with a few keystrokes
cask "raycast"
# System monitor for the menu bar
cask "stats"
# Compatibility layer to run Windows applications
cask "wine-stable"
# Multiplayer code editor
cask "zed"
vscode "13xforever.language-x86-64-assembly"
vscode "akamud.vscode-theme-onedark"
vscode "alfish.godot-files"
vscode "ardenivanov.svelte-intellisense"
vscode "astro-build.astro-vscode"
vscode "atlassian.atlascode"
vscode "austin.code-gnu-global"
vscode "awtnb.d2-arrow"
vscode "biomejs.biome"
vscode "bracketpaircolordlw.bracket-pair-color-dlw"
vscode "bradlc.vscode-tailwindcss"
vscode "codeium.codeium"
vscode "cschlosser.doxdocgen"
vscode "dan-c-underwood.arm"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "elfinsight.elfinsight"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "fivethree.vscode-svelte-snippets"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "geequlim.godot-tools"
vscode "generalov.vscode-tfs"
vscode "genieai.chatgpt-vscode"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "gruntfuggly.todo-tree"
vscode "gtylcara-gewinn.verilog"
vscode "humao.rest-client"
vscode "idma88.omp-pragma"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "jeff-hykin.better-cpp-syntax"
vscode "jjaakko.markdown-kbd"
vscode "kamikillerto.vscode-colorize"
vscode "karigari.chat"
vscode "kevinrose.vsc-python-indent"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "leafvmaple.verilog"
vscode "madhavd1.javadoc-tools"
vscode "mechatroner.rainbow-csv"
vscode "meta.relay"
vscode "mgmcdermott.vscode-language-babel"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "mohsen1.prettify-json"
vscode "mquandalle.graphql"
vscode "ms-azuretools.vscode-containers"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.js-debug-nightly"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.mono-debug"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.vscode-serial-monitor"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "mshr-h.veriloghdl"
vscode "neikeq.godot-csharp-vscode"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "plex.vscode-protolint"
vscode "prisma.prisma"
vscode "prisma.prisma-insider"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rvest.vs-code-prettier-eslint"
vscode "scala-lang.scala"
vscode "scalameta.metals"
vscode "sonarsource.sonarlint-vscode"
vscode "svelte.svelte-vscode"
vscode "t1mt.makefile-helper"
vscode "tadayosi.vscode-makefile-outliner"
vscode "terrastruct.d2"
vscode "tht13.html-preview-vscode"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vitest.explorer"
vscode "vladmrnv.expresssnippet"
vscode "vsciot-vscode.vscode-arduino"
vscode "vscjava.migrate-java-to-azure"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-java-upgrade"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
vscode "wayou.vscode-todo-highlight"
vscode "withfig.fig"
vscode "xabikos.javascriptsnippets"
vscode "ypresto.vscode-accelerated"
vscode "zignd.html-css-class-completion"
vscode "zxh404.vscode-proto3"
go "github.com/dkorunic/betteralign/cmd/betteralign"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/onsi/ginkgo/v2/ginkgo"
go "github.com/ofabry/go-callvis"
go "mvdan.cc/gofumpt"
go "github.com/golangci/golangci-lint/cmd/golangci-lint"
go "github.com/pressly/goose/v3/cmd/goose"
go "golang.org/x/tools/gopls"
go "github.com/acoshift/goreload"
go "github.com/peam1146/gotruct/cmd/gotruct"
go "github.com/Just-maple/go-autowire/cmd/gutowire"
go "github.com/golang/mock/mockgen"
go "github.com/peam1146/goverter/cmd/peamverter"
go "google.golang.org/protobuf/cmd/protoc-gen-go"
go "google.golang.org/grpc/cmd/protoc-gen-go-grpc"
go "github.com/sqlc-dev/sqlc/cmd/sqlc"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/swaggo/swag/v2/cmd/swag"
go "github.com/google/wire/cmd/wire"
